[
  {
    "name": "John Doe",
    "datePosted": 1695648000,
    "rating": 5,
    "reviewTitle": "Best Dorm Ever!",
    "review": "Living in this dorm has been an amazing experience! The rooms are spacious, the common areas are always clean, and the location is perfect—right next to the campus and close to all the facilities. The community here is very friendly, and I've made lifelong friends. The dorm staff is super helpful, and the maintenance team responds quickly. Definitely the best place to live if you want to enjoy your college experience to the fullest."
  },
  {
    "name": "Jane Smith",
    "datePosted": 1695561600,
    "rating": 4,
    "reviewTitle": "Great Dorm, But Some Noise",
    "review": "Overall, my time in this dorm has been great. The rooms are modern, and the amenities, like the study lounges and gym, are really convenient. The only downside is that it can get a bit noisy during the weekends due to parties, but that's expected in a college dorm. The staff is friendly, and maintenance requests are handled quickly. I would definitely recommend it if you're okay with occasional noise."
  },
  {
    "name": "Mike Johnson",
    "datePosted": 1695475200,
    "rating": 3,
    "reviewTitle": "Decent Dorm, But Overpriced",
    "review": "This dorm is decent, but for the price, I expected more. The rooms are a bit smaller than I imagined, and the Wi-Fi can be unreliable at times, which is frustrating when trying to study. The common areas are nice, and the location is convenient, but I feel like there are better options for the money. It’s not terrible, but I wouldn’t choose it again if I had other affordable options."
  },
  {
    "name": "Emily Davis",
    "datePosted": 1695388800,
    "rating": 2,
    "reviewTitle": "Not Worth the Cost",
    "review": "I was really disappointed with this dorm. For how expensive it is, I expected a much better living experience. The rooms are small and outdated, and the air conditioning barely works, making it unbearable during hot months. Also, the noise from the street kept me up most nights. The only redeeming quality is the location, but other than that, I wouldn’t recommend staying here unless you’re desperate."
  },
  {
    "name": "Chris Lee",
    "datePosted": 1695302400,
    "rating": 1,
    "reviewTitle": "Horrible Experience",
    "review": "My experience in this dorm was absolutely terrible. The room was filthy when I moved in, and it took weeks for maintenance to address my concerns. The building is old and falling apart, with mold in the bathrooms and broken elevators. The staff was rude and unhelpful, and the noise from other residents made it impossible to study or sleep. I ended up moving out early because I couldn't take it anymore. Stay away from this place!"
  }
]
